Tekla.Structures.Model.History.ModifiedObjectInfo
Modification info returned by History.

Tekla.Structures.Model.History.ModifiedObjectInfo.ModelObject
Gets the object modified.
The object modified.

Tekla.Structures.Model.History.ModifiedObjectInfo.IsAttributeChanged
Whether the object attribute (UDA) has changed.
true if the object attribute has changed; otherwise, false.

Tekla.Structures.Model.History.ModifiedObjectInfo.IsModified
Whether the object's has changed in a way that affects its numbering. This can include some UDA change.
true if the object is new or its property has changed; otherwise, false.

Tekla.Structures.Model.History.ModifiedObjectInfo.IsCreated
Whether the object was created

Tekla.Structures.Model.History.ModifiedObjectInfo.IsNumberingChanged
Whether the numbering of object has changed.
true if the numbering of object has changed; otherwise, false.
Remarks:
True only if the object has been re-numbered. Modifications to object which require re-numbering are only indicated with Tekla.Structures.Model.History.ModifiedObjectInfo.IsModified.